{
    "name": "task_trials",
    "csv": "https://raw.githubusercontent.com/AllenInstitute/np_nwb/main/db/json/DRpilot_649943_20230216/intervals/task_trials.csv",
    "column_names_to_descriptions": {
        "quiescent_start_time": "Start of period in which the subject should not lick, otherwise the trial will be aborted and start over; currently just the last quiescent period which was not violated; not tracking quiescent violations ",
        "opto_start_time": "Onset of optogenetic inactivation.",
        "quiescent_stop_time": "End of period in which the subject should not lick, otherwise the trial will be aborted and start over.",
        "stim_start_time": "Onset of visual or auditory stimulus.",
        "response_window_start_time": "Start of window in which the subject should lick if a GO trial, otherwise should not lick.",
        "stim_stop_time": "Offset of visual or auditory stimulus.",
        "response_time": "Time of first lick in the response window, or NaN if no lick occurred.",
        "response_window_stop_time": "End of window in which the subject should lick if a GO trial, otherwise should not lick.",
        "opto_stop_time": "Offset of optogenetic inactivation.",
        "post_response_window_start_time": "Start of null period in which the subject awaits a new trial or a timeout period; may receive a noncontingent reward if scheduled.",
        "post_response_window_stop_time": "",
        "timeout_start_time": "Start of extended inter-trial period added due to a false alarm.",
        "timeout_stop_time": "",
        "stim_name": "TODO",
        "stim_index": "0-indexed stim number, randomized over trials; refers to `nwb.stimulus.templates` table; nan for catch trials ",
        "block_index": "0-indexed block number, increments with each block.",
        "context_name": "TODO",
        "index": "0-indexed trial number for regular trials (with stimuli), increments over time; nan for catch trials ",
        "index_within_block": "0-indexed trial number within a block, increments over the block; nan for catch trials ",
        "scheduled_reward_index_within_block": " # TODO check w/Sam; changed from 'noncontingent_reward_index_within_block'; autoreward scheduled, not necessarily given ",
        "TODO_opto_area_name": "Target location for optogenetic inactivation during the trial.",
        "TODO_opto_area_index": "Target location for optogenetic inactivation during the trial; nan if no opto applied ",
        "opto_voltage": "",
        "galvo_voltage_x": "",
        "galvo_voltage_y": "",
        "repeat_number": "Number of times the trial has already been presented in immediately preceding trials (repeated due to false alarm); nan for catch trials ",
        "is_response": "The subject licked one or more times during the response window.",
        "is_correct": "The subject acted correctly in the response window, according to its training; includes catch trials ",
        "is_incorrect": "The subject acted incorrectly in the response window, according to its training; includes catch trials ",
        "is_hit": "The subject responded in a GO trial.",
        "is_false_alarm": "The subject responded in a NOGO trial.",
        "is_correct_reject": "The subject did not respond in a NOGO trial; excludes catch trials ",
        "is_miss": "The subject did not respond in a GO trial.",
        "is_go": "Condition in which the subject should respond; target stim presented in rewarded context block ",
        "is_nogo": "Condition in which the subject should not respond; non-target stim presented in any context block; target stim presented in non-rewarded context block; excludes catch trials ",
        "is_rewarded": "The subject received a reward; includes non-contingent rewards ",
        "is_noncontingent_reward": "The subject received a reward that did not depend on its response.",
        "is_contingent_reward": "The subject received a reward for a correct response in a GO trial.",
        "is_reward_scheduled": "A non-contingent reward was scheduled to occur; subject may have responded correctly and received contingent reward instead ",
        "is_aud_stim": "An auditory stimulus was presented; target and non-target stimuli; rewarded and unrewarded contexts ",
        "is_vis_stim": "A visual stimulus was presented; target and non-target stimuli; rewarded and unrewarded contexts ",
        "is_catch": "No stimulus was presented.",
        "is_aud_target": "An auditory stimulus was presented that the subject should respond to in a certain context.",
        "is_vis_target": "A visual stimulus was presented that the subject should respond to in a certain context.",
        "is_aud_nontarget": "An auditory stimulus was presented that the subject should never respond to.",
        "is_vis_nontarget": "A visual stimulus was presented that the subject should never respond to.",
        "is_vis_context": "Trial occurs within a block in which the subject should respond to a visual target.",
        "is_aud_context": "Trial occurs within a block in which the subject should respond to a auditory target.",
        "is_repeat": "The trial is a repetition of the previous trial, which resulted in a miss; always False on first full trial after context block switch; False for catch trials ",
        "is_opto": "Optogenetic inactivation was applied during the trial.",
        "is_context_switch": "The first trial with a stimulus after a change in context."
    },
    "description": "auditory/visual routing behavior task trials: divided into sequential `blocks` that switch the reward contingency between `aud_target` and `vis_target`"
}